In [1]:
import pandas as pd

# Importieren der Daten

In [2]:
df_namen = pd.read_csv('../src/vorname_nachname.csv', sep=';')
df_namen

       title     vorname     nachname
0        dr.  Mozelle         hellier
1  prof. dr.  Quentin        shreenan
2        dr.    Emory        stienham
3        NaN      Nils          ricks
4        NaN       Jean      ayscough
5        NaN     Brander    santorini
6       med.      Debee   vasilischev
7        NaN  Doloritas         moden
8   dr. med.      Nils       macourek
9        NaN   Joscelin        savege

In [3]:
df_namen = df_namen.fillna('')
df_namen

       title     vorname     nachname
0        dr.  Mozelle         hellier
1  prof. dr.  Quentin        shreenan
2        dr.    Emory        stienham
3                 Nils          ricks
4                  Jean      ayscough
5                Brander    santorini
6       med.      Debee   vasilischev
7             Doloritas         moden
8   dr. med.      Nils       macourek
9              Joscelin        savege

# Text formatieren
* Leerzeichen entfernen
* Alles Großschreiben (Upper Case)
* Alles Kleinschreiben (Lower Case)
* Nur den Ersten Buchstaben groß schreiben (Capital)
* Texte immer Pascal Case schreiben (Title)

In [4]:
# --- new zell ---
df_namen['vorname'] = df_namen['vorname'].str.strip()
df_namen['vorname']

0      Mozelle
1      Quentin
2        Emory
3         Nils
4         Jean
5      Brander
6        Debee
7    Doloritas
8         Nils
9     Joscelin
Name: vorname, dtype: object

In [5]:
# --- new zell ---
df_namen['vorname'].str.upper()

0      MOZELLE
1      QUENTIN
2        EMORY
3         NILS
4         JEAN
5      BRANDER
6        DEBEE
7    DOLORITAS
8         NILS
9     JOSCELIN
Name: vorname, dtype: object

In [6]:
# --- new zell ---
df_namen['vorname'].str.lower()

0      mozelle
1      quentin
2        emory
3         nils
4         jean
5      brander
6        debee
7    doloritas
8         nils
9     joscelin
Name: vorname, dtype: object

In [7]:
# --- new zell ---
df_namen['nachname'] = df_namen['nachname'].str.capitalize()
df_namen['nachname']

0        Hellier
1       Shreenan
2       Stienham
3          Ricks
4       Ayscough
5      Santorini
6    Vasilischev
7          Moden
8       Macourek
9         Savege
Name: nachname, dtype: object

In [8]:
# --- new zell ---
df_namen['title'].str.capitalize()

0          Dr.
1    Prof. dr.
2          Dr.
3
4
5
6         Med.
7
8     Dr. med.
9
Name: title, dtype: object

In [9]:
# --- new zell ---
df_namen['title'] = df_namen['title'].str.title()
df_namen

       title    vorname     nachname
0        Dr.    Mozelle      Hellier
1  Prof. Dr.    Quentin     Shreenan
2        Dr.      Emory     Stienham
3                  Nils        Ricks
4                  Jean     Ayscough
5               Brander    Santorini
6       Med.      Debee  Vasilischev
7             Doloritas        Moden
8   Dr. Med.       Nils     Macourek
9              Joscelin       Savege

# Trennen und Verbinden

In [10]:
# --- new zell --- 
df_namen['vorname'] + df_namen['nachname']

0      MozelleHellier
1     QuentinShreenan
2       EmoryStienham
3           NilsRicks
4        JeanAyscough
5    BranderSantorini
6    DebeeVasilischev
7      DoloritasModen
8        NilsMacourek
9      JoscelinSavege
dtype: object

In [11]:
# --- new zell --- 
df_namen['vorname'] + ' ' + df_namen['nachname']

0      Mozelle Hellier
1     Quentin Shreenan
2       Emory Stienham
3           Nils Ricks
4        Jean Ayscough
5    Brander Santorini
6    Debee Vasilischev
7      Doloritas Moden
8        Nils Macourek
9      Joscelin Savege
dtype: object

In [12]:
# --- new zell ---
df_namen['name'] = df_namen['vorname'].str.cat(df_namen['nachname'], sep=' ')
df_namen

       title    vorname     nachname               name
0        Dr.    Mozelle      Hellier    Mozelle Hellier
1  Prof. Dr.    Quentin     Shreenan   Quentin Shreenan
2        Dr.      Emory     Stienham     Emory Stienham
3                  Nils        Ricks         Nils Ricks
4                  Jean     Ayscough      Jean Ayscough
5               Brander    Santorini  Brander Santorini
6       Med.      Debee  Vasilischev  Debee Vasilischev
7             Doloritas        Moden    Doloritas Moden
8   Dr. Med.       Nils     Macourek      Nils Macourek
9              Joscelin       Savege    Joscelin Savege

In [13]:
# --- new zell ---
df_namen['name'].str.split(' ', expand=True)

           0            1
0    Mozelle      Hellier
1    Quentin     Shreenan
2      Emory     Stienham
3       Nils        Ricks
4       Jean     Ayscough
5    Brander    Santorini
6      Debee  Vasilischev
7  Doloritas        Moden
8       Nils     Macourek
9   Joscelin       Savege

In [14]:
# --- new zell ---
df_namen['vorname_split'] = df_namen['name'].str.split(' ', expand=True)[0]
df_namen['nachname_split'] = df_namen['name'].str.split(' ', expand=True)[1]
df_namen

,title,vorname,nachname,name,vorname_split,nachname_split
0,Dr.,Mozelle,Hellier,Mozelle Hellier,Mozelle,Hellier
1,Prof. Dr.,Quentin,Shreenan,Quentin Shreenan,Quentin,Shreenan
2,Dr.,Emory,Stienham,Emory Stienham,Emory,Stienham
3,,Nils,Ricks,Nils Ricks,Nils,Ricks
4,,Jean,Ayscough,Jean Ayscough,Jean,Ayscough
5,,Brander,Santorini,Brander Santorini,Brander,Santorini
6,Med.,Debee,Vasilischev,Debee Vasilischev,Debee,Vasilischev
7,,Doloritas,Moden,Doloritas Moden,Doloritas,Moden
8,Dr. Med.,Nils,Macourek,Nils Macourek,Nils,Macourek
9,,Joscelin,Savege,Joscelin Savege,Joscelin,Savege

# Suchen und Ersetzen

In [15]:
# --- new zell ---
df_namen['title'].str.contains('Dr.')

0     True
1     True
2     True
3    False
4    False
5    False
6    False
7    False
8     True
9    False
Name: title, dtype: bool

In [16]:
# --- new zell ---
df_namen[df_namen['title'].str.contains('Dr.')]

       title  vorname  nachname              name vorname_split nachname_split
0        Dr.  Mozelle   Hellier   Mozelle Hellier       Mozelle        Hellier
1  Prof. Dr.  Quentin  Shreenan  Quentin Shreenan       Quentin       Shreenan
2        Dr.    Emory  Stienham    Emory Stienham         Emory       Stienham
8   Dr. Med.     Nils  Macourek     Nils Macourek          Nils       Macourek

In [17]:
# --- new zell ---
df_namen['nachname'].str.startswith('S')

0    False
1     True
2     True
3    False
4    False
5     True
6    False
7    False
8    False
9     True
Name: nachname, dtype: bool

In [18]:
# --- new zell ---
df_namen[df_namen['nachname'].str.startswith('Sa')]

  title   vorname   nachname               name vorname_split nachname_split
5         Brander  Santorini  Brander Santorini       Brander      Santorini
9        Joscelin     Savege    Joscelin Savege      Joscelin         Savege

In [19]:
# --- new zell ---
df_namen['title'] = df_namen['title'].str.replace('Med.', '')
df_namen

,title,vorname,nachname,name,vorname_split,nachname_split
0,Dr.,Mozelle,Hellier,Mozelle Hellier,Mozelle,Hellier
1,Prof. Dr.,Quentin,Shreenan,Quentin Shreenan,Quentin,Shreenan
2,Dr.,Emory,Stienham,Emory Stienham,Emory,Stienham
3,,Nils,Ricks,Nils Ricks,Nils,Ricks
4,,Jean,Ayscough,Jean Ayscough,Jean,Ayscough
5,,Brander,Santorini,Brander Santorini,Brander,Santorini
6,,Debee,Vasilischev,Debee Vasilischev,Debee,Vasilischev
7,,Doloritas,Moden,Doloritas Moden,Doloritas,Moden
8,Dr.,Nils,Macourek,Nils Macourek,Nils,Macourek
9,,Joscelin,Savege,Joscelin Savege,Joscelin,Savege

## Dokumentation und weitere Funktionen
https://pandas.pydata.org/pandas-docs/stable/user_guide/text.html